In [1]:
!pip install pandas sqlalchemy pyodbc mysql-connector-python

Requirement already satisfied: pandas in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (2.0.1)
Requirement already satisfied: sqlalchemy in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (2.0.40)
Requirement already satisfied: pyodbc in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (5.2.0)
Requirement already satisfied: mysql-connector-python in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (8.0.33)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hp\appdata\roaming\python\python310\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: greenlet>=1 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (3.2.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from mysql-connector-python) (3.20.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -rotobuf (c:\users\hp\appdata\roaming\python\python310\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\hp\appdata\roaming\python\python310\site-packages)
WARNING: Ignoring invalid distribution -otebook (c:\users\hp\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\hp\appdata\roaming\python\python310\site-packages)
WARNING: Ignoring invalid distribution -otebook (c:\users\hp\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\hp\appdata\roaming\python\python310\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\hp\appdata\roaming\python\python310\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\hp\appdata\roaming\python\python310\site-packages)

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

### Import Data from Excel

In [3]:
import pandas as pd
# Load Excel file
data_excel = pd.read_excel('sales data.xlsx')
print(data_excel.head())

    Unnamed: 0   Unnamed: 1
0          NaN          NaN
1   Categories  Sum of cost
2  Accessories   3920034.37
3   Appliances  12604789.39
4       Beauty  10450636.45

In [4]:
data_excel

     Unnamed: 0   Unnamed: 1
0           NaN          NaN
1    Categories  Sum of cost
2   Accessories   3920034.37
3    Appliances  12604789.39
4        Beauty  10450636.45
5         Books  10954065.02
6      Clothing  14719744.04
7   Electronics  12080944.62
8         Games   12768205.6
9         Other   2713949.49
10     Outdoors   4882312.93
11  Smartphones      9281007
12  Grand Total  94375688.91

In [4]:
data_excel.head()

    Unnamed: 0   Unnamed: 1
0          NaN          NaN
1   Categories  Sum of cost
2  Accessories   3920034.37
3   Appliances  12604789.39
4       Beauty  10450636.45

### Import Data From SQL Server

In [5]:
pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   --------------------------- ------------ 30.7/45.0 kB 660.6 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 739.0 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [6]:
from sqlalchemy import create_engine
import pandas as pd

# URL-encoded password
engine = create_engine("mysql+pymysql://root:amruta@localhost:3306/Salesdb")

data_sql = pd.read_sql("SELECT * FROM Orders", engine)
print(data_sql.head())

   OrderID   OrderDate  CustomerID CustomerName   Amount
0        1  2024-01-10         101    Aarti Hol  1200.50
1        2  2024-01-12         102  Rahul Mehta   450.00
2        3  2024-01-15         103  Neha Sharma  3200.00
3        4  2024-01-17         104    Raj Patel   780.25
4        5  2024-02-01         105  Sneha Joshi  1500.00

In [7]:
import pandas as pd
from sqlalchemy import create_engine, text

# Create the SQLAlchemy engine
engine = create_engine("mysql+pymysql://root:amruta@localhost:3306/Salesdb")

# Use a raw SQLAlchemy connection properly
with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM Orders"))
    data_sql = pd.DataFrame(result.fetchall(), columns=result.keys())

print(data_sql.head())

   OrderID   OrderDate  CustomerID CustomerName   Amount
0        1  2024-01-10         101    Aarti Hol  1200.50
1        2  2024-01-12         102  Rahul Mehta   450.00
2        3  2024-01-15         103  Neha Sharma  3200.00
3        4  2024-01-17         104    Raj Patel   780.25
4        5  2024-02-01         105  Sneha Joshi  1500.00

In [21]:
#mysql code
-- Create the database
CREATE DATABASE IF NOT EXISTS Salesdb;

-- Switch to the newly created database
USE Salesdb;

-- Create the Orders table
CREATE TABLE Orders (
    OrderID INT AUTO_INCREMENT PRIMARY KEY,
    OrderDate DATE,
    CustomerID INT,
    CustomerName VARCHAR(100),
    Amount DECIMAL(15, 2)
);

-- Insert sample data into Orders
INSERT INTO Orders (OrderDate, CustomerID, CustomerName, Amount) VALUES
('2024-01-10', 101, 'Aarti Hol', 1200.50),
('2024-01-12', 102, 'Rahul Mehta', 450.00),
('2024-01-15', 103, 'Neha Sharma', 3200.00),
('2024-01-17', 104, 'Raj Patel', 780.25),
('2024-02-01', 105, 'Sneha Joshi', 1500.00),
('2024-02-03', 106, 'Aman Khan', 2150.75),
('2024-02-07', 101, 'Aarti Hol', 999.99),
('2024-02-10', 107, 'Divya Kaur', 1350.60),
('2024-02-15', 108, 'Karan Verma', 2888.88),
('2024-03-01', 109, 'Meena Iyer', 1899.90);

SyntaxError: invalid syntax (175385827.py, line 2)